cjacker/opensource-toolchain-8051/stc-headers/stc8a8k64d4.h
#define TM2PS (*(unsigned char volatile __xdata *)0xfea2)
#define TM3PS (*(unsigned char volatile __xdata *)0xfea3)
#define TM4PS (*(unsigned char volatile __xdata *)0xfea4)
#define ADCTIM (*(unsigned char volatile __xdata *)0xfea8)
#define ADCEXCFG (*(unsigned char volatile __xdata *)0xfead)
#define CMPEXCFG (*(unsigned char volatile __xdata *)0xfeae)

/////////////////////////////////////////////////
//FD00H-FDFFH
/////////////////////////////////////////////////

#define P0INTE (*(unsigned char volatile __xdata *)0xfd00)
#define P1INTE (*(unsigned char volatile __xdata *)0xfd01)
#define P2INTE (*(unsigned char volatile __xdata *)0xfd02)
#define P3INTE (*(unsigned char volatile __xdata *)0xfd03)
#define P4INTE (*(unsigned char volatile __xdata *)0xfd04)
#define P5INTE (*(unsigned char volatile __xdata *)0xfd05)
#define P6INTE (*(unsigned char volatile __xdata *)0xfd06)
#define P7INTE (*(unsigned char volatile __xdata *)0xfd07)
#define P0INTF (*(unsigned char volatile __xdata *)0xfd10)
#define P1INTF (*(unsigned char volatile __xdata *)0xfd11)
#define P2INTF (*(unsigned char volatile __xdata *)0xfd12)
#define P3INTF (*(unsigned char volatile __xdata *)0xfd13)
#define P4INTF (*(unsigned char volatile __xdata *)0xfd14)
#define P5INTF (*(unsigned char volatile __xdata *)0xfd15)
#define P6INTF (*(unsigned char volatile __xdata *)0xfd16)
#define P7INTF (*(unsigned char volatile __xdata *)0xfd17)
#define P0IM0 (*(unsigned char volatile __xdata *)0xfd20)
#define P1IM0 (*(unsigned char volatile __xdata *)0xfd21)
#define P2IM0 (*(unsigned char volatile __xdata *)0xfd22)
#define P3IM0 (*(unsigned char volatile __xdata *)0xfd23)
#define P4IM0 (*(unsigned char volatile __xdata *)0xfd24)
#define P5IM0 (*(unsigned char volatile __xdata *)0xfd25)
#define P6IM0 (*(unsigned char volatile __xdata *)0xfd26)
#define P7IM0 (*(unsigned char volatile __xdata *)0xfd27)
#define P0IM1 (*(unsigned char volatile __xdata *)0xfd30)
#define P1IM1 (*(unsigned char volatile __xdata *)0xfd31)
#define P2IM1 (*(unsigned char volatile __xdata *)0xfd32)
#define P3IM1 (*(unsigned char volatile __xdata *)0xfd33)
#define P4IM1 (*(unsigned char volatile __xdata *)0xfd34)
#define P5IM1 (*(unsigned char volatile __xdata *)0xfd35)
#define P6IM1 (*(unsigned char volatile __xdata *)0xfd36)
#define P7IM1 (*(unsigned char volatile __xdata *)0xfd37)
#define P0WKUE (*(unsigned char volatile __xdata *)0xfd40)
#define P1WKUE (*(unsigned char volatile __xdata *)0xfd41)
#define P2WKUE (*(unsigned char volatile __xdata *)0xfd42)
#define P3WKUE (*(unsigned char volatile __xdata *)0xfd43)
#define P4WKUE (*(unsigned char volatile __xdata *)0xfd44)
#define P5WKUE (*(unsigned char volatile __xdata *)0xfd45)
#define P6WKUE (*(unsigned char volatile __xdata *)0xfd46)
#define P7WKUE (*(unsigned char volatile __xdata *)0xfd47)

#define CCAPM3 (*(unsigned char volatile __xdata *)0xfd54)
#define CCAP3L (*(unsigned char volatile __xdata *)0xfd55)
#define CCAP3H (*(unsigned char volatile __xdata *)0xfd56)
#define PCA_PWM3 (*(unsigned char volatile __xdata *)0xfd57)

#define PIN_IP (*(unsigned char volatile __xdata *)0xfd60)
#define PIN_IPH (*(unsigned char volatile __xdata *)0xfd61)

#define CHIPID0 (*(unsigned char volatile __xdata *)0xfde0)
#define CHIPID1 (*(unsigned char volatile __xdata *)0xfde1)
#define CHIPID2 (*(unsigned char volatile __xdata *)0xfde2)
#define CHIPID3 (*(unsigned char volatile __xdata *)0xfde3)
#define CHIPID4 (*(unsigned char volatile __xdata *)0xfde4)
#define CHIPID5 (*(unsigned char volatile __xdata *)0xfde5)
#define CHIPID6 (*(unsigned char volatile __xdata *)0xfde6)
#define CHIPID7 (*(unsigned char volatile __xdata *)0xfde7)
#define CHIPID8 (*(unsigned char volatile __xdata *)0xfde8)
#define CHIPID9 (*(unsigned char volatile __xdata *)0xfde9)
#define CHIPID10 (*(unsigned char volatile __xdata *)0xfdea)
#define CHIPID11 (*(unsigned char volatile __xdata *)0xfdeb)
#define CHIPID12 (*(unsigned char volatile __xdata *)0xfdec)
#define CHIPID13 (*(unsigned char volatile __xdata *)0xfded)
#define CHIPID14 (*(unsigned char volatile __xdata *)0xfdee)
#define CHIPID15 (*(unsigned char volatile __xdata *)0xfdef)
#define CHIPID16 (*(unsigned char volatile __xdata *)0xfdf0)
#define CHIPID17 (*(unsigned char volatile __xdata *)0xfdf1)
#define CHIPID18 (*(unsigned char volatile __xdata *)0xfdf2)
#define CHIPID19 (*(unsigned char volatile __xdata *)0xfdf3)
#define CHIPID20 (*(unsigned char volatile __xdata *)0xfdf4)
#define CHIPID21 (*(unsigned char volatile __xdata *)0xfdf5)
#define CHIPID22 (*(unsigned char volatile __xdata *)0xfdf6)
#define CHIPID23 (*(unsigned char volatile __xdata *)0xfdf7)
#define CHIPID24 (*(unsigned char volatile __xdata *)0xfdf8)
#define CHIPID25 (*(unsigned char volatile __xdata *)0xfdf9)
#define CHIPID26 (*(unsigned char volatile __xdata *)0xfdfa)
#define CHIPID27 (*(unsigned char volatile __xdata *)0xfdfb)
#define CHIPID28 (*(unsigned char volatile __xdata *)0xfdfc)
#define CHIPID29 (*(unsigned char volatile __xdata *)0xfdfd)
#define CHIPID30 (*(unsigned char volatile __xdata *)0xfdfe)
#define CHIPID31 (*(unsigned char volatile __xdata *)0xfdff)

/////////////////////////////////////////////////
//FC00H-FCFFH
/////////////////////////////////////////////////

#define MD3 (*(unsigned char volatile __xdata *)0xfcf0)
#define MD2 (*(unsigned char volatile __xdata *)0xfcf1)
#define MD1 (*(unsigned char volatile __xdata *)0xfcf2)
#define MD0 (*(unsigned char volatile __xdata *)0xfcf3)
#define MD5 (*(unsigned char volatile __xdata *)0xfcf4)
#define MD4 (*(unsigned char volatile __xdata *)0xfcf5)
#define dwOP1 (*(unsigned long volatile __xdata *)0xfcf0)
#define wOP1 (*(unsigned int volatile __xdata *)0xfcf2)
#define wOP2 (*(unsigned int volatile __xdata *)0xfcf4)
#define ARCON (*(unsigned char volatile __xdata *)0xfcf6)
#define MDU16_OP_RSHIFT (1 << 5)
#define MDU16_OP_LSHIFT (2 << 5)
#define MDU16_OP_NORMALIZE (3 << 5)
#define MDU16_OP_16MUL16 (4 << 5)
#define MDU16_OP_16DIV16 (5 << 5)
#define MDU16_OP_32DIV16 (6 << 5)
#define OPCON (*(unsigned char volatile __xdata *)0xfcf7)
#define MDU16_START 0x01
#define MDU16_BUSY 0x01
#define MDU16_RESET 0x02

/////////////////////////////////////////////////
//FB00H-FBFFH
/////////////////////////////////////////////////


/////////////////////////////////////////////////
//FA00H-FAFFH
/////////////////////////////////////////////////

#define DMA_ADC_CFG (*(unsigned char volatile __xdata *)0xfa10)
#define DMA_ADC_CR (*(unsigned char volatile __xdata *)0xfa11)
#define DMA_ADC_STA (*(unsigned char volatile __xdata *)0xfa12)
#define DMA_ADC_RXA (*(unsigned int volatile __xdata *)0xfa17)
#define DMA_ADC_RXAH (*(unsigned char volatile __xdata *)0xfa17)
#define DMA_ADC_RXAL (*(unsigned char volatile __xdata *)0xfa18)
#define DMA_ADC_CFG2 (*(unsigned char volatile __xdata *)0xfa19)
#define DMA_ADC_CHSW0 (*(unsigned char volatile __xdata *)0xfa1a)
#define DMA_ADC_CHSW1 (*(unsigned char volatile __xdata *)0xfa1b)

