cjacker/opensource-toolchain-8051/stc-headers/stc8a8k64d4.h
#define DMA_SPI_CFG (*(unsigned char volatile __xdata *)0xfa20)
#define DMA_SPI_CR (*(unsigned char volatile __xdata *)0xfa21)
#define DMA_SPI_STA (*(unsigned char volatile __xdata *)0xfa22)
#define DMA_SPI_AMT (*(unsigned char volatile __xdata *)0xfa23)
#define DMA_SPI_DONE (*(unsigned char volatile __xdata *)0xfa24)
#define DMA_SPI_TXA (*(unsigned int volatile __xdata *)0xfa25)
#define DMA_SPI_TXAH (*(unsigned char volatile __xdata *)0xfa25)
#define DMA_SPI_TXAL (*(unsigned char volatile __xdata *)0xfa26)
#define DMA_SPI_RXA (*(unsigned int volatile __xdata *)0xfa27)
#define DMA_SPI_RXAH (*(unsigned char volatile __xdata *)0xfa27)
#define DMA_SPI_RXAL (*(unsigned char volatile __xdata *)0xfa28)
#define DMA_SPI_CFG2 (*(unsigned char volatile __xdata *)0xfa29)

#define DMA_UR1T_CFG (*(unsigned char volatile __xdata *)0xfa30)
#define DMA_UR1T_CR (*(unsigned char volatile __xdata *)0xfa31)
#define DMA_UR1T_STA (*(unsigned char volatile __xdata *)0xfa32)
#define DMA_UR1T_AMT (*(unsigned char volatile __xdata *)0xfa33)
#define DMA_UR1T_DONE (*(unsigned char volatile __xdata *)0xfa34)
#define DMA_UR1T_TXA (*(unsigned int volatile __xdata *)0xfa35)
#define DMA_UR1T_TXAH (*(unsigned char volatile __xdata *)0xfa35)
#define DMA_UR1T_TXAL (*(unsigned char volatile __xdata *)0xfa36)
#define DMA_UR1R_CFG (*(unsigned char volatile __xdata *)0xfa38)
#define DMA_UR1R_CR (*(unsigned char volatile __xdata *)0xfa39)
#define DMA_UR1R_STA (*(unsigned char volatile __xdata *)0xfa3a)
#define DMA_UR1R_AMT (*(unsigned char volatile __xdata *)0xfa3b)
#define DMA_UR1R_DONE (*(unsigned char volatile __xdata *)0xfa3c)
#define DMA_UR1R_RXA (*(unsigned int volatile __xdata *)0xfa3d)
#define DMA_UR1R_RXAH (*(unsigned char volatile __xdata *)0xfa3d)
#define DMA_UR1R_RXAL (*(unsigned char volatile __xdata *)0xfa3e)

#define DMA_UR2T_CFG (*(unsigned char volatile __xdata *)0xfa40)
#define DMA_UR2T_CR (*(unsigned char volatile __xdata *)0xfa41)
#define DMA_UR2T_STA (*(unsigned char volatile __xdata *)0xfa42)
#define DMA_UR2T_AMT (*(unsigned char volatile __xdata *)0xfa43)
#define DMA_UR2T_DONE (*(unsigned char volatile __xdata *)0xfa44)
#define DMA_UR2T_TXA (*(unsigned int volatile __xdata *)0xfa45)
#define DMA_UR2T_TXAH (*(unsigned char volatile __xdata *)0xfa45)
#define DMA_UR2T_TXAL (*(unsigned char volatile __xdata *)0xfa46)
#define DMA_UR2R_CFG (*(unsigned char volatile __xdata *)0xfa48)
#define DMA_UR2R_CR (*(unsigned char volatile __xdata *)0xfa49)
#define DMA_UR2R_STA (*(unsigned char volatile __xdata *)0xfa4a)
#define DMA_UR2R_AMT (*(unsigned char volatile __xdata *)0xfa4b)
#define DMA_UR2R_DONE (*(unsigned char volatile __xdata *)0xfa4c)
#define DMA_UR2R_RXA (*(unsigned int volatile __xdata *)0xfa4d)
#define DMA_UR2R_RXAH (*(unsigned char volatile __xdata *)0xfa4d)
#define DMA_UR2R_RXAL (*(unsigned char volatile __xdata *)0xfa4e)

#define DMA_UR3T_CFG (*(unsigned char volatile __xdata *)0xfa50)
#define DMA_UR3T_CR (*(unsigned char volatile __xdata *)0xfa51)
#define DMA_UR3T_STA (*(unsigned char volatile __xdata *)0xfa52)
#define DMA_UR3T_AMT (*(unsigned char volatile __xdata *)0xfa53)
#define DMA_UR3T_DONE (*(unsigned char volatile __xdata *)0xfa54)
#define DMA_UR3T_TXA (*(unsigned int volatile __xdata *)0xfa55)
#define DMA_UR3T_TXAH (*(unsigned char volatile __xdata *)0xfa55)
#define DMA_UR3T_TXAL (*(unsigned char volatile __xdata *)0xfa56)
#define DMA_UR3R_CFG (*(unsigned char volatile __xdata *)0xfa58)
#define DMA_UR3R_CR (*(unsigned char volatile __xdata *)0xfa59)
#define DMA_UR3R_STA (*(unsigned char volatile __xdata *)0xfa5a)
#define DMA_UR3R_AMT (*(unsigned char volatile __xdata *)0xfa5b)
#define DMA_UR3R_DONE (*(unsigned char volatile __xdata *)0xfa5c)
#define DMA_UR3R_RXA (*(unsigned int volatile __xdata *)0xfa5d)
#define DMA_UR3R_RXAH (*(unsigned char volatile __xdata *)0xfa5d)
#define DMA_UR3R_RXAL (*(unsigned char volatile __xdata *)0xfa5e)

#define DMA_UR4T_CFG (*(unsigned char volatile __xdata *)0xfa60)
#define DMA_UR4T_CR (*(unsigned char volatile __xdata *)0xfa61)
#define DMA_UR4T_STA (*(unsigned char volatile __xdata *)0xfa62)
#define DMA_UR4T_AMT (*(unsigned char volatile __xdata *)0xfa63)
#define DMA_UR4T_DONE (*(unsigned char volatile __xdata *)0xfa64)
#define DMA_UR4T_TXA (*(unsigned int volatile __xdata *)0xfa65)
#define DMA_UR4T_TXAH (*(unsigned char volatile __xdata *)0xfa65)
#define DMA_UR4T_TXAL (*(unsigned char volatile __xdata *)0xfa66)
#define DMA_UR4R_CFG (*(unsigned char volatile __xdata *)0xfa68)
#define DMA_UR4R_CR (*(unsigned char volatile __xdata *)0xfa69)
#define DMA_UR4R_STA (*(unsigned char volatile __xdata *)0xfa6a)
#define DMA_UR4R_AMT (*(unsigned char volatile __xdata *)0xfa6b)
#define DMA_UR4R_DONE (*(unsigned char volatile __xdata *)0xfa6c)
#define DMA_UR4R_RXA (*(unsigned int volatile __xdata *)0xfa6d)
#define DMA_UR4R_RXAH (*(unsigned char volatile __xdata *)0xfa6d)
#define DMA_UR4R_RXAL (*(unsigned char volatile __xdata *)0xfa6e)

#define DMA_LCM_CFG (*(unsigned char volatile __xdata *)0xfa70)
#define DMA_LCM_CR (*(unsigned char volatile __xdata *)0xfa71)
#define DMA_LCM_STA (*(unsigned char volatile __xdata *)0xfa72)
#define DMA_LCM_AMT (*(unsigned char volatile __xdata *)0xfa73)
#define DMA_LCM_DONE (*(unsigned char volatile __xdata *)0xfa74)
#define DMA_LCM_TXA (*(unsigned int volatile __xdata *)0xfa75)
#define DMA_LCM_TXAH (*(unsigned char volatile __xdata *)0xfa75)
#define DMA_LCM_TXAL (*(unsigned char volatile __xdata *)0xfa76)
#define DMA_LCM_RXA (*(unsigned int volatile __xdata *)0xfa77)
#define DMA_LCM_RXAH (*(unsigned char volatile __xdata *)0xfa77)
#define DMA_LCM_RXAL (*(unsigned char volatile __xdata *)0xfa78)


/////////////////////////////////////////////////

#define INT0_VECTOR 0//0003H
#define TMR0_VECTOR 1//000BH
#define INT1_VECTOR 2//0013H
#define TMR1_VECTOR 3//001BH
#define UART1_VECTOR 4//0023H
#define ADC_VECTOR 5//002BH
#define LVD_VECTOR 6//0033H
#define PCA_VECTOR 7//003BH
#define UART2_VECTOR 8//0043H
#define SPI_VECTOR 9//004BH
#define INT2_VECTOR 10//0053H
#define INT3_VECTOR 11//005BH
#define TMR2_VECTOR 12//0063H
#define USER_VECTOR 13//006BH
#define INT4_VECTOR 16//0083H
#define UART3_VECTOR 17//008BH
#define UART4_VECTOR 18//0093H
#define TMR3_VECTOR 19//009BH
#define TMR4_VECTOR 20//00A3H
#define CMP_VECTOR 21//00ABH
#define PWM_VECTOR 22//00B3H
#define PWMFD_VECTOR 23//00BBH
#define I2C_VECTOR 24//00C3H
#define P0INT_VECTOR 37//012BH
#define P1INT_VECTOR 38//0133H
#define P2INT_VECTOR 39//013BH
#define P3INT_VECTOR 40//0143H
#define P4INT_VECTOR 41//014BH
#define P5INT_VECTOR 42//0153H
#define P6INT_VECTOR 43//015BH
#define P7INT_VECTOR 44//0163H
#define M2MDMA_VECTOR 47//017BH
#define ADCDMA_VECTOR 48//0183H
#define SPIDMA_VECTOR 49//018BH
#define U1TXDMA_VECTOR 50//0193H
#define U1RXDMA_VECTOR 51//019BH
#define U2TXDMA_VECTOR 52//01A3H
#define U2RXDMA_VECTOR 53//01ABH
#define U3TXDMA_VECTOR 54//01B3H
#define U3RXDMA_VECTOR 55//01BBH
#define U4TXDMA_VECTOR 56//01C3H
#define U4RXDMA_VECTOR 57//01CBH
#define LCMDMA_VECTOR 58//01D3H
#define LCM_VECTOR 59//01DBH

/////////////////////////////////////////////////

#endif

